# GetField Method (ScheduleFieldId)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..GetField Method (ScheduleFieldId)
ScheduleDefinition Class See Also
---
Gets a field.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ScheduleField GetField(
	ScheduleFieldId fieldId
)
```

Visual Basic
---
```text
Public Function GetField ( _
	fieldId As ScheduleFieldId _
) As ScheduleField
```

Visual C++
---
```text
public:
ScheduleField^ GetField(
	ScheduleFieldId^ fieldId
)
```

# ### Parameters
fieldId
    Type: Autodesk.Revit.DB..::..ScheduleFieldId The ID of the field.
# ### Return Value
The field.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | fieldId is not the ID of a field in this ScheduleDefinition. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ScheduleDefinition Class
GetField Overload
Autodesk.Revit.DB Namespace